app/views/records/_form.html.erb

    <% if !(params[:id].nil?) %>
      <td><%= form.collection_select :domain_id, Domain.order(:name), :id, :name, selected:params[:id] %></td>
    <% else %>
      <td><%= form.collection_select :domain_id, Domain.order(:name), :id, :name, include_blank: true %></td>
---
SELECT "domains".* FROM "domains" ORDER BY "domains"."name" ASC