app/controllers/domains_controller.rb

  def index
    @domains = Domain.where(domains_id: nil)
---
SELECT "domains".* FROM "domains" WHERE "domains"."domains_id" IS NULL

  def show
    @domains_contained = Domain.where(domains_id: params[:id])
    @records = Record.where(domain_id: params[:id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."domain_id" = ?  [["domain_id", 1]]

  def new
    @domain = Domain.new

    if params[:id]
      @domain.domains = Domain.find(params[:id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @domain = Domain.new()

    if domain_params[:domains] != ""
      @domain.domains = Domain.find(domain_params[:domains])
    end

    @domain.name = domain_params[:name]
    @domain.type_domain = domain_params[:type_domain]
    @domain.ttl = domain_params[:ttl]
    @domain.primary_name_server = domain_params[:primary_name_server]
    @domain.contact = domain_params[:contact]
    @domain.refresh = domain_params[:refresh]
    @domain.expire = domain_params[:expire]
    @domain.retry = domain_params[:retry]
    @domain.minimum = domain_params[:minimum]

    respond_to do |format|
      if @domain.save
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "domains" ("name", "type_domain", "ttl", "primary_name_server", "contact", "refresh", "retry", "expire", "minimum", "created_at", "updated_at", "domains_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|

      new_values = {
          "name"=>domain_params[:name],
          "type_domain"=>domain_params[:type_domain],
          "ttl"=>domain_params[:ttl],
          "primary_name_server"=>domain_params[:primary_name_server],
          "contact"=>domain_params[:contact],
          "refresh"=>domain_params[:refresh],
          "retry"=>domain_params[:retry],
          "expire"=>domain_params[:expire],
          "minimum"=>domain_params[:minimum],
          "domains"=>nil
      }


      if domain_params[:domains] != ""
        new_values[:domains] = Domain.find(domain_params[:domains].to_i)
      end


      if @domain.update(new_values)
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "domains" SET "refresh" = ?, "retry" = ?, "expire" = ?, "minimum" = ?, "updated_at" = ? WHERE "domains"."id" = ?  [["refresh", 1], ["retry", 2], ["expire", 3], ["minimum", 4], ["updated_at", "2019-10-25 17:51:06.489291"], ["id", 8]]

  def destroy
    @domain.destroy
---
DELETE FROM "domains" WHERE "domains"."id" = ?  [["id", 6]]

    def set_domain
      @domain = Domain.find(params[:id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]