app/controllers/domains_controller.rb

  def index
    @domains = Domain.where(domains_id: nil)
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

  def new
    @domain = Domain.new

    if params[:id]
      @domain.domains = Domain.find(params[:id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."domains_id" = ?  [["domains_id", 980190962]]

  def create
    @domain = Domain.new()

    if domain_params[:domains] != ""
      @domain.domains = Domain.find(domain_params[:domains])
    end

    @domain.name = domain_params[:name]
    @domain.type_domain = domain_params[:type_domain]
    @domain.ttl = domain_params[:ttl]
    @domain.primary_name_server = domain_params[:primary_name_server]
    @domain.contact = domain_params[:contact]
    @domain.refresh = domain_params[:refresh]
    @domain.expire = domain_params[:expire]
    @domain.retry = domain_params[:retry]
    @domain.minimum = domain_params[:minimum]

    respond_to do |format|
      if @domain.save
---
SELECT "domains".* FROM "domains" WHERE "domains"."domains_id" = ?  [["domains_id", 1]]
SELECT "domains".* FROM "domains" ORDER BY "domains"."name" ASC
UPDATE "domains" SET "ttl" = ?, "refresh" = ?, "retry" = ?, "expire" = ?, "minimum" = ?, "domains_id" = ?, "updated_at" = ? WHERE "domains"."id" = ?  [["ttl", "1"], ["refresh", "1"], ["retry", "2"], ["expire", "3"], ["minimum", "4"], ["domains_id", nil], ["updated_at", "2019-10-22 12:57:31.425842"], ["id", 1]]

  def update
    respond_to do |format|

      new_values = {
          "name"=>domain_params[:name],
          "type_domain"=>domain_params[:type_domain],
          "ttl"=>domain_params[:ttl],
          "primary_name_server"=>domain_params[:primary_name_server],
          "contact"=>domain_params[:contact],
          "refresh"=>domain_params[:refresh],
          "retry"=>domain_params[:retry],
          "expire"=>domain_params[:expire],
          "minimum"=>domain_params[:minimum],
          "domains"=>nil
      }


      if domain_params[:domains] != ""
        new_values[:domains] = Domain.find(domain_params[:domains].to_i)
      end


      if @domain.update(new_values)
---
SELECT "domains".* FROM "domains" WHERE "domains"."domains_id" = ?  [["domains_id", 1]]
UPDATE "domains" SET "ttl" = ?, "refresh" = ?, "retry" = ?, "expire" = ?, "minimum" = ?, "domains_id" = ?, "updated_at" = ? WHERE "domains"."id" = ?  [["ttl", "1"], ["refresh", "1"], ["retry", "2"], ["expire", "3"], ["minimum", "4"], ["domains_id", nil], ["updated_at", "2019-10-22 00:57:34.255366"], ["id", 1]]

    def set_domain
      @domain = Domain.find(params[:id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."domains_id" = ?  [["domains_id", 980190962]]