app/controllers/domains_controller.rb

SELECT "domains".* FROM "domains"
---
  def index
    @domains = Domain.all

SELECT "domains".* FROM "domains" WHERE "domains"."is_contained_id" = ?  [["is_contained_id", 1]]
---
  def show
    @domains_contained = Domain.where(is_contained_id: params[:id])

INSERT INTO "domains" ("name", "type_domain", "ttl", "primary_name_server", "contact", "refresh", "retry", "expire", "minimum", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @domain = Domain.new(domain_params)

    respond_to do |format|
      if @domain.save

DELETE FROM "domains" WHERE "domains"."id" = ?  [["id", 4]]
---
  def destroy
    @domain.destroy