app/controllers/records_controller.rb

SELECT "records".* FROM "records" ORDER BY "records"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @records = Record.all

SELECT "records".* FROM "records" WHERE "records"."domain_id" IS NULL
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def create
    @record = Record.new(record_params)
    valid = true


    if @record.type_record == "CNAME"
      # Se o tipo é um CNAME, não pode existir outro Record,
      #com o mesmo nome, no mesmo Domain.

      records_domain = Record.where(domain_id: @record.domain_id)

      records_domain.each do |r|

UPDATE "records" SET "domain_id" = ?, "type_record" = ?, "host" = ?, "ttl" = ?, "content" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["domain_id", 1], ["type_record", "CNAME"], ["host", "meuhost"], ["ttl", "200"], ["content", "content"], ["updated_at", "2019-10-22 13:12:27.214763"], ["id", 980190962]]
---


    respond_to do |format|
      if valid and @record.save

UPDATE "records" SET "domain_id" = ?, "type_record" = ?, "name" = ?, "ttl" = ?, "content" = ?, "class_record" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["domain_id", 1], ["type_record", "CNAME"], ["name", "meuhost"], ["ttl", "200"], ["content", "content"], ["class_record", "IN"], ["updated_at", "2019-10-24 18:44:52.196782"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @record.update(record_params)

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_record
      @record = Record.find(params[:id])