app/controllers/records_controller.rb

INSERT INTO "records" ("type_record", "host", "ttl", "content", "priority", "created_at", "updated_at", "domain_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["type_record", "TXT"], ["host", "a"], ["ttl", "1"], ["content", "a"], ["priority", 2], ["created_at", "2019-10-17 03:03:16.123112"], ["updated_at", "2019-10-17 03:03:16.123112"], ["domain_id", 1]]
---
  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save

DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]
---
  def destroy
    @record.destroy

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_record
      @record = Record.find(params[:id])