app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
    @records = Record.all

SELECT "records".* FROM "records" WHERE "records"."domain_id" = ?  [["domain_id", 1]]
SELECT "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "records" WHERE "records"."type_record" = ? AND "records"."host" = ? AND "records"."domain_id" = ?  [["type_record", "CNAME"], ["host", "meuhost"], ["domain_id", 4]]
---
  def create
    @record = Record.new(record_params)
    valid = true


    if @record.type_record == "CNAME"
      # Se o tipo é um CNAME, não pode existir outro Record,
      #com o mesmo nome, no mesmo Domain.

      records_domain = Record.where(domain_id: @record.domain_id)

      records_domain.each do |r|

        if @record.host == r.host
            valid = false
        end

      end

    else
      #Se o tipo não é um CNAME, não pode existir um Record do tipo CNAME,
      #com o mesmo nome, no mesmo Domain.

      records_cname_domain = Record.where(type_record: "CNAME", host: @record.host,
       domain_id: @record.domain_id).count()

INSERT INTO "records" ("type_record", "name", "ttl", "content", "priority", "created_at", "updated_at", "domain_id", "class_record") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---


    respond_to do |format|
      if valid and @record.save

UPDATE "records" SET "domain_id" = ?, "content" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["domain_id", 3], ["content", "123.123.123.123.1"], ["updated_at", "2019-10-23 00:05:15.048088"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @record.update(record_params)

DELETE FROM "records" WHERE "records"."id" = ?  [["id", 40]]
---
  def destroy
    @record.destroy

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_record
      @record = Record.find(params[:id])